#+TITLE: System Operation tasks
#+AUTHOR: VLEAD
#+DATE: [2017-11-01 Wed]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export


* Introduction
  This document contains the system operations tasks.


* Operations Snapshot
  |---+------+-----------+-------+-------+--------|
  |   | S.no | Month     |   Est |   Act | Issues |
  |   |      |           |   hrs |   hrs |        |
  |---+------+-----------+-------+-------+--------|
  |   |   1. | September |    19 |    24 | [[https://gitlab.com/vlead-systems/systems-operations/issues?scope%3Dall&utf8%3D%E2%9C%93&state%3Dall&label_name%3DSeptember-2017][ref]]    |
  |---+------+-----------+-------+-------+--------|
  |   |   2. | October   |  3.15 |  6.15 | [[https://gitlab.com/vlead-systems/systems-operations/issues?scope=all&utf8=%E2%9C%93&state=opened&label_name=October-2017][ref]]    |
  |---+------+-----------+-------+-------+--------|
  |   |      | Total     | 22.15 | 30.15 |        |
  | ^ |      |           |    et |    at |        |
  |---+------+-----------+-------+-------+--------|
  #+TBLFM: $1=@#+1
  #+TBLFM: @3$4=remote(tbl-sept, $Estimated)
  #+TBLFM: @3$5=remote(tbl-sept, $Actual)
  #+TBLFM: @4$4=remote(tbl-oct, $Estimated)
  #+TBLFM: @4$5=remote(tbl-oct, $Actual)
  #+TBLFM: $et=vsum(@II+1..@-1)
  #+TBLFM: $at=vsum(@II+1..@-1)


  
* 2017
** September
#+caption: Tasks
#+name: tbl-sept
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   |    S. | Tasks                                                   | Github |  Expected | Actual | Estimated        | Actual           | Status | Assignee     | Assigned by        |
|   |    no |                                                         | Issues |    Effort | Effort | Start/           | Start,           |        |              |                    |
|   |       |                                                         |        |       (in |    (in | End              | End              |        |              |                    |
|   |       |                                                         |        |    person | person | Dates            | Dates            |        |              |                    |
|   |       |                                                         |        |    hours) | hours) |                  |                  |        |              |                    |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   |    1. | Add dogwood vagrantbox to files.vlabs.ac.in server      | [[https://gitlab.com/vlead-systems/systems-operations/issues/214][Issue]]  |         8 |      8 |                  |                  | Done   | Siva Shanker | Thirumal           |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   |    2. | Issue restaring an apache server                        | [[https://gitlab.com/vlead-systems/systems-operations/issues/215][Issue]]  |         1 |      1 | [2017-09-13 Wed] | [2017-09-13 Wed] | Done   | Siva Shanker | Sadhana Virupaksha |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   |    3. | Provide Test machine of production                      | [[https://gitlab.com/vlead-systems/systems-operations/issues/212][Issue]]  |         2 |      3 | [2017-09-12 Tue] | [2017-09-12 Tue] |        |              |                    |
|   |       | vlabs landing page without customized theme             |        |           |        | [2017-09-13 Wed] | [2017-09-13 Wed] | Done   | Siva Shanker | Madhavi Puliraju   |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   |    4. | Enable SSL certificates on themeless.vlabs.ac.in        | [[https://gitlab.com/vlead-systems/systems-operations/issues/216][Issue]]  |         1 |      1 | [2017-09-13 Wed] | [2017-09-13 Wed] | Done   | Siva Shanker | Thirumal Ravula    |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   |    5. | Wifi driver installation in the laptop                  | [[https://gitlab.com/vlead-systems/systems-operations/issues/217][Issue]]  |         2 |      1 | [2017-09-13 Wed] | [2017-09-13 Wed] | Done   | Siva Shanker | Sanchita           |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   |    6. | Setup and configure Prof.Vishwanath Dell Laptop machine | [[https://gitlab.com/vlead-systems/systems-operations/issues/220][Issue]]  |         3 |      8 | [2017-09-14 Thu] | [2017-09-14 Thu] |        |              |                    |
|   |       |                                                         |        |           |        | [2017-09-15 Fri] | [2017-09-15 Fri] | Done   | Siva Shanker | Prof. Venkatesh    |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   |    7. | Create a open edx vagrant box                           | [[https://github.com/vlead/vlead-onboarding/issues/5][Issue]]  |         2 |      2 | [2017-09-19 Tue] | [2017-09-19 Tue] | Done   | Siva Shanker | Thirumal Ravula    |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
|   | Total |                                                         |        |        19 |     24 |                  |                  |        |              |                    |
| ^ |       |                                                         |        | Estimated | Actual |                  |                  |        |              |                    |
|---+-------+---------------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+--------------------|
#+TBLFM: $1=@#+1
#+TBLFM: $Estimated=vsum(@II+1..@-1)
#+TBLFM: $Actual=vsum(@II+1..@-1)


* October
   #+caption: October 
   #+name: tbl-oct
   |-------+---------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+-------------|
   | S.    | Tasks                                             | Github | Expected  | Actual | Estimated        | Actual           | Status | Assignee     | Assigned by |
   | NO    |                                                   | Issues | Effort    | Effort | Start/           | Start,           |        |              |             |
   |       |                                                   |        | (in       | (in    | End              | End              |        |              |             |
   |       |                                                   |        | person    | person | Dates            | Dates            |        |              |             |
   |       |                                                   |        | hours)    | hours) |                  |                  |        |              |             |
   |-------+---------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+-------------|
   | 1.    | Virtual Box download link on vlabs landing page   | [[https://gitlab.com/vlead-systems/systems-operations/issues/254][Issue]]  | 3         | 6      | [2017-10-24 Tue] | [2017-10-26 Thu] | Done   | Siva Shanker | Priya       |
   |       |                                                   |        |           |        |                  |                  |        |              |             |
   |-------+---------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+-------------|
   | 2.    | assign public access to domain header.vlabs.ac.in | [[https://gitlab.com/vlead-systems/systems-operations/issues/255][Issue]]  | 0.15      | 0.15   | [2017-10-26 Thu] | [2017-10-26 Thu] | Done   | Siva Shanker | Sripathi    |
   |-------+---------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+-------------|
   | Total |                                                   |        | 3.15      | 6.15   |                  |                  |        |              |             |
   | ^     |                                                   |        | Estimated | Actual |                  |                  |        |              |             |
   |-------+---------------------------------------------------+--------+-----------+--------+------------------+------------------+--------+--------------+-------------|
   #+TBLFM: $1=@#+1
   #+TBLFM: $Estimated=vsum(@II+1..@-1)
   #+TBLFM: $Actual=vsum(@II+1..@-1)
